{
	"blues": "Blues is a music genre[2] and musical form originated by African Americans in the Deep South of the United States around the end of the 19th century. The genre developed from roots in African musical traditions, African-American work songs, spirituals, and the folk music of white Americans of European heritage.[1] Blues incorporated spirituals, work songs, field hollers, shouts, chants, and rhymed simple narrative ballads.[3] The blues form, ubiquitous in jazz, rhythm and blues and rock and roll, is characterized by the call-and-response pattern, the blues scale and specific chord progressions, of which the twelve-bar blues is the most common. Blue notes (or 'worried notes'), usually thirds or fifths flattened in pitch, are also an essential part of the sound. Blues shuffles or walking bass reinforce the trance-like rhythm and form a repetitive effect known as the groove.",

	"classical": "Classical music is a very general term which normally refers to the standard music of countries in the Western world. It is music that has been composed by musicians who are trained in the art of writing music (composing) and written down in music notation so that other musicians can play it. Classical music may also be described as 'art music' though it was not good in classical period that term also Includes types of serious modern music which are not classical. Classical music differs from pop music because it is not made just in order to be popular for time or just to be a commercial success. It is different from folk music which is generally made up by ordinary members of society and learned by future generations by listening, dancing and copying.",

	"country": "Country music, also known as country and western or simply country, is a genre of popular music that originated in the southern United States in the early 1920s.[1] It takes its roots from genres such as folk music (especially Appalachian folk music) and blues. Country music often consists of ballads and dance tunes with generally simple forms, folk lyric and harmonies accompanied by mostly string instruments such as banjos, electric and acoustic guitars, steel guitars (such as pedal steels and dobros), and fiddles as well as harmonicas.[2][3][4] Blues modes have been used extensively throughout its recorded history.[5]",

	"disco": "Disco is a musical style that emerged in the early 1970s from America's urban nightlife scene, where it originated in house parties and makeshift discotheques, reaching its popularity between the mid-1970s to and early 1980s. Its initial audiences in the U.S. were club-goers, both male and female, from the African American, Italian American,[1][2] Latino, gay, and psychedelic communities in Philadelphia and New York City during the late 1960s and early 1970s. Disco can be seen as a reaction against both the domination of rock music and the stigmatization of dance music by the counterculture during this period. Several dances styles were also developed during this time including the Bump and the Hustle.",

	"hiphop": "Hip hop music, also called hip-hop[3][4] or rap music,[4][5][6] is a music genre developed in the United States by inner-city African Americans in the 1970s which consists of a stylized rhythmic music that commonly accompanies rapping, a rhythmic and rhyming speech that is chanted.[4] It developed as part of hip hop culture, a subculture defined by four key stylistic elements: MCing/rapping, DJing/scratching with turntables, break dancing, and graffiti writing.[7][8][9] Other elements include sampling beats or bass lines from records (or synthesized beats and sounds), and rhythmic beatboxing. While often used to refer solely to rapping, 'hip hop' more properly denotes the practice of the entire subculture.[10][11] The term hip hop music is sometimes used synonymously with the term rap music,[4][12] though rapping is not a required component of hip hop music; the genre may also incorporate other elements of hip hop culture, including DJing, turntablism, scratching, beatboxing, and instrumental tracks.[13][14]",

	"jazz": "Jazz is a music genre that originated in the African-American communities of New Orleans, United States,[1] in the late 19th and early 20th centuries, and developed from roots in blues and ragtime.[2] Jazz is seen by many as 'America's classical music'.[3] Since the 1920s Jazz Age, jazz has become recognized as a major form of musical expression. It then emerged in the form of independent traditional and popular musical styles, all linked by the common bonds of African-American and European-American musical parentage with a performance orientation.[4]",

	"metal": "Heavy metal (or simply metal) is a genre of rock music[1] that developed in the late 1960s and early 1970s, largely in the United Kingdom.[2] With roots in blues rock and psychedelic/acid rock,[3] the bands that created heavy metal developed a thick, massive sound, characterized by highly amplified distortion, extended guitar solos, emphatic beats, and overall loudness. Heavy metal lyrics and performance styles are sometimes associated with aggression and machismo.[3]",

	"pop": "Pop Stylistic origins Traditional pop[1] rock and roll[2] folk[3] Cultural origins Mid-1950s, United States and United Kingdom Derivative forms Disco Subgenres Art pop Brill Building bubblegum pop dance-pop experimental pop hypnagogic pop operatic pop progressive pop schlager sophisti-pop space age pop sunshine pop synth-pop teen pop Fusion genres Baroque pop beat Contemporary Christian country pop electropop indie pop jangle pop Latin pop noise pop pop punk pop-rap pop rock power pop psychedelic pop R&B reggae fusion smooth jazz smooth soul Regional scenes China India Indonesia Hong Kong Italy Japan Korea Malaysia Mexican Morocco Pakistan Philippines Russia Scandinavia Sweden Taiwan Thailand Turkey United Kingdom United States Vietnam Western Europe Other topics Avant-pop pop music automation poptimism rock music Pop music is a genre of popular music that originated in its modern form in the United States and United Kingdom during the mid-1950s.[4] The terms 'popular music' and 'pop music' are often used interchangeably, although the former describes all music that is popular and includes many different styles. 'Pop' and 'rock' were roughly synonymous terms until the late 1960s, when they became increasingly differentiated from each other.",

	"reggae": "Reggae is a music genre that originated in Jamaica in the late 1960s. The term also denotes the modern popular music of Jamaica and its diaspora.[1] A 1968 single by Toots and the Maytals, 'Do the Reggay' was the first popular song to use the word 'reggae, effectively naming the genre and introducing it to a global audience.[2][3] While sometimes used in a broad sense to refer to most types of popular Jamaican dance music, the term reggae more properly denotes a particular music style that was strongly influenced by traditional mento as well as American jazz and rhythm and blues, especially the New Orleans R&B practiced by Fats Domino and Allen Toussaint, and evolved out of the earlier genres ska and rocksteady.[4]",

	"rock": "Rock music is a broad genre of popular music that originated as 'rock and roll' in the United States in the early 1950s, and developed into a range of different styles in the 1960s and later, particularly in the United Kingdom and in the United States.[1][2] It has its roots in 1940s and 1950s rock and roll, a style which drew heavily on the African-American genres of blues and rhythm and blues, and from country music. Rock music also drew strongly on a number of other genres such as electric blues and folk, and incorporated influences from jazz, classical and other musical styles. Musically, rock has centered on the electric guitar, usually as part of a rock group with electric bass and drums and one or more singers. Typically, rock is song-based music usually with a 4/4 time signature using a verse–chorus form, but the genre has become extremely diverse. Like pop music, lyrics often stress romantic love but also address a wide variety of other themes that are frequently social or political."
}